app/views/companies/show.html.haml

SELECT "employees".* FROM "employees" WHERE "employees"."company_id" = $1  [[nil, 1]]
---
  %h2
    - if @company.employees.blank?