app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Fri, 12 Jul 2013 09:22:01 UTC +00:00], ["name", "Tavant Technologies"], ["updated_at", Fri, 12 Jul 2013 09:22:01 UTC +00:00]]