app/controllers/employees_controller.rb

INSERT INTO "employees" ("company_id", "created_at", "name", "salary", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["company_id", 2], ["created_at", Fri, 12 Jul 2013 10:12:32 UTC +00:00], ["name", "Vijay"], ["salary", {"fixed"=>"6.0", "variable"=>"0.75"}], ["updated_at", Fri, 12 Jul 2013 10:12:32 UTC +00:00]]
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "name" = $1, "company_id" = $2, "updated_at" = $3 WHERE "employees"."id" = 980190962  [["name", "Name changed"], ["company_id", 980190962], ["updated_at", Fri, 12 Jul 2013 12:12:49 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)